const ArrayList = require("arraylist");

const list = new ArrayList();

list.set(0, "가장 좋아하는 음식과 싫어하는 음식은 무엇입니까?");
list.set(1, "좋아하는 패션은 무엇입니까?");
list.set(2, "애완동물로 가장 선호하는 동물은 무엇입니까?");
list.set(3, "좋아하는 머리 스타일은 무엇입니까?");
list.set(4, "아침 식사로 어떤 음식을 좋아하나요?");
list.set(5, "가장 친한 친구는 누구입니까?");
list.set(6, "당신에게 가장 영향을 미치는 모임은 어떤 모임인가요?");
list.set(7, "당신이 가장 좋아하는 영화는 무엇입니까?");
list.set(8, "닮은 사람이 있나요?");
list.set(9, "당신만 할 수 있는 특별한 재능이 있나요?");
list.set(
  10,
  "인생에서 가장 중요한 가치는 무엇인가요? (돈, 여유, 사랑, 가족 등)"
);
list.set(11, "버킷리스트는 무엇인가요?");
list.set(
  12,
  "일주일 동안 한 음식만 먹고 살아야 한다면 어떤 음식을 선택하겠습니까?"
);
list.set(13, "어떤 냄새를 좋아하나요?");
list.set(14, "안전하지만 특별히 무서워하는 동물이 있나요?");
list.set(15, "하고 싶은 사업 아이템이 있나요?");
list.set(16, "사람들이 당신을 부르는 별명이 있나요?");
list.set(17, "불리고 싶은 이름이나, 별명이 있다면 무엇인가요?");
list.set(18, "사람들은 당신의 어떤 모습을 보고 놀랄까요?");
list.set(19, "요즘 당신의 가장 큰 고민은 무엇입니까?");
list.set(20, "가장 좋아하는 책은 무엇인가요? 그 이유는?");
list.set(21, "좋아하는 축제나 박람회가 있습니까?");
list.set(22, "좋아하는 TV 프로그램은 무엇인가요?");
list.set(23, "좋아하는 운동이 있나요?");
list.set(24, "당신이 가장 자주 들어가는 홈페이지나 애플리케이션은 어디인가요?");
list.set(25, "배우고 싶은 분야가 있나요?");
list.set(
  26,
  "밖에 나갈 때 반드시 챙기는 물건이 있나요? (휴대폰이나 지갑 말고)"
);
list.set(27, "연애 스타일은 어떻습니까?");

module.exports = { list };
